Revit 2026 API
InsulationType.Name Property
 Get name of Insulation type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public override string Name { set; }
Public Overrides WriteOnly Property Name As String
	Set
public:
virtual property String^ Name {
	void set (String^ value) override;
}
abstract Name : string with set
override Name : string with set
Property Value
String
Exceptions
Exception | Condition
InvalidOperationException | Set name can't be supported.
See Also
Reference
InsulationType Class
Autodesk.Revit.DB.Electrical Namespace